/*
 * @Description: 
 * @Author: jinxiaojian
 * @Email: jinxiaojian@youxin.com
 * @LastEditors: 靳肖健
 * @Date: 2019-03-24 21:03:18
 * @LastEditTime: 2019-03-24 21:16:30
 */

课程 
名校 
学校云 
2020考研 
名师专栏 新 
 
客户端 
 
搜索感兴趣的课程
 
个人中心 
 



 
Java程序设计
国家精品
唐大仕 
评价课程

 
公告
评分标准
课件
测验与作业
考试
讨论区
课程分享
 



微信提醒课程进度

扫码下载APP
帮助中心 
Week3 测试
返回
本次得分为：22.00/40.00, 本次测试的提交时间为：2019-03-24, 如果你认为本次测试成绩不理想，你可以选择再做一次。
1
判断(2分)
数据类型决定数据的存储方式和运算方式
得分/总分

A.

2.00/2.00

B.


2
判断(2分)
Java中的数据类型分为两大类
得分/总分

A.

2.00/2.00

B.


3
判断(2分)
String属于引用类型
得分/总分

A.



B.

2.00/2.00
4
判断(2分)
Java中引用类型在赋值时，复制的是对象实体。
得分/总分

A.



B.

0.00/2.00
5
判断(2分)
3.14是float型。
得分/总分

A.

0.00/2.00

B.


6
判断(2分)
534L表示长整数。
得分/总分

A.

2.00/2.00

B.


7
判断(2分)
字符串连接运算符其实是用append来实现的。
得分/总分

A.

2.00/2.00

B.


8
判断(2分)
15/4的结果是3.75。
得分/总分

A.



B.

0.00/2.00
9
判断(2分)
&表示短路与运算。
得分/总分

A.



B.

0.00/2.00
10
判断(2分)
书写表达式要少用或不用括号。
得分/总分

A.

0.00/2.00

B.


11
判断(2分)
javap –c命令可以反汇编代码。
得分/总分

A.

2.00/2.00

B.


12
判断(2分)
程序的三种基本流程是顺序、分支、循环。
得分/总分

A.

2.00/2.00

B.


13
判断(2分)
Java中可以在任一表达式后面加分号构成表达式语句。
得分/总分

A.

0.00/2.00

B.


14
判断(2分)
case后面可以跟变量。
得分/总分

A.

0.00/2.00

B.


15
判断(2分)
循环语句有三种写法。
得分/总分

A.



B.

2.00/2.00
16
判断(2分)
循环一般有五个要素。
得分/总分

A.

2.00/2.00

B.


17
判断(2分)
main()的写法是public void main(int argc, String[]argv)
得分/总分

A.



B.

0.00/2.00
18
判断(2分)
声明数组时可以直接指定数组的大小。
得分/总分

A.

0.00/2.00

B.


19
判断(2分)
数组都是引用类型。
得分/总分

A.



B.

2.00/2.00
20
判断(2分)
数组元素都会隐式初始化。
得分/总分

A.

2.00/2.00

B.
